/*
 * Some utility functions on VTermRect structures
 */

#నిర్వచించు STRFrect "(%d,%d-%d,%d)"
#నిర్వచించు ARGSrect(r) (r).ప్రారంభం_అడ్డువరుస, (r).ప్రారంభం_నిలువు, (r).చివర_అడ్డువరుస, (r).చివర_నిలువు

/* Expand dst to contain src as well */
స్థిర శూన్య rect_expand(VTermRect *dst, VTermRect *src)
{
  ఒకవేళ(dst->ప్రారంభం_అడ్డువరుస > src->ప్రారంభం_అడ్డువరుస) dst->ప్రారంభం_అడ్డువరుస = src->ప్రారంభం_అడ్డువరుస;
  ఒకవేళ(dst->ప్రారంభం_నిలువు > src->ప్రారంభం_నిలువు) dst->ప్రారంభం_నిలువు = src->ప్రారంభం_నిలువు;
  ఒకవేళ(dst->చివర_అడ్డువరుస   < src->చివర_అడ్డువరుస)   dst->చివర_అడ్డువరుస   = src->చివర_అడ్డువరుస;
  ఒకవేళ(dst->చివర_నిలువు   < src->చివర_నిలువు)   dst->చివర_నిలువు   = src->చివర_నిలువు;
}

/* Clip the dst to ensure it does not step outside of bounds */
స్థిర శూన్య rect_clip(VTermRect *dst, VTermRect *bounds)
{
  ఒకవేళ(dst->ప్రారంభం_అడ్డువరుస < bounds->ప్రారంభం_అడ్డువరుస) dst->ప్రారంభం_అడ్డువరుస = bounds->ప్రారంభం_అడ్డువరుస;
  ఒకవేళ(dst->ప్రారంభం_నిలువు < bounds->ప్రారంభం_నిలువు) dst->ప్రారంభం_నిలువు = bounds->ప్రారంభం_నిలువు;
  ఒకవేళ(dst->చివర_అడ్డువరుస   > bounds->చివర_అడ్డువరుస)   dst->చివర_అడ్డువరుస   = bounds->చివర_అడ్డువరుస;
  ఒకవేళ(dst->చివర_నిలువు   > bounds->చివర_నిలువు)   dst->చివర_నిలువు   = bounds->చివర_నిలువు;
  /* Ensure it doesn't end up negatively-sized */
  ఒకవేళ(dst->చివర_అడ్డువరుస < dst->ప్రారంభం_అడ్డువరుస) dst->చివర_అడ్డువరుస = dst->ప్రారంభం_అడ్డువరుస;
  ఒకవేళ(dst->చివర_నిలువు < dst->ప్రారంభం_నిలువు) dst->చివర_నిలువు = dst->ప్రారంభం_నిలువు;
}

/* True if the two rectangles are equal */
స్థిర పూర్ణాంకం rect_equal(VTermRect *a, VTermRect *b)
{
  తిరిగి (a->ప్రారంభం_అడ్డువరుస == b->ప్రారంభం_అడ్డువరుస) &&
         (a->ప్రారంభం_నిలువు == b->ప్రారంభం_నిలువు) &&
         (a->చివర_అడ్డువరుస   == b->చివర_అడ్డువరుస)   &&
         (a->చివర_నిలువు   == b->చివర_నిలువు);
}

/* True if small is contained entirely within big */
స్థిర పూర్ణాంకం rect_కలిగియుంది(VTermRect *big, VTermRect *small)
{
  ఒకవేళ(small->ప్రారంభం_అడ్డువరుస < big->ప్రారంభం_అడ్డువరుస) తిరిగి 0;
  ఒకవేళ(small->ప్రారంభం_నిలువు < big->ప్రారంభం_నిలువు) తిరిగి 0;
  ఒకవేళ(small->చివర_అడ్డువరుస   > big->చివర_అడ్డువరుస)   తిరిగి 0;
  ఒకవేళ(small->చివర_నిలువు   > big->చివర_నిలువు)   తిరిగి 0;
  తిరిగి 1;
}

/* True if the rectangles overlap at all */
స్థిర పూర్ణాంకం rect_intersects(VTermRect *a, VTermRect *b)
{
  ఒకవేళ(a->ప్రారంభం_అడ్డువరుస > b->చివర_అడ్డువరుస || b->ప్రారంభం_అడ్డువరుస > a->చివర_అడ్డువరుస)
    తిరిగి 0;
  ఒకవేళ(a->ప్రారంభం_నిలువు > b->చివర_నిలువు || b->ప్రారంభం_నిలువు > a->చివర_నిలువు)
    తిరిగి 0;
  తిరిగి 1;
}
